#+TITLE: Data transfer overhead and latency profiling

** H2D data transfer analysis

CUDA event time includes both CPU overhead as well as PCIe transfer latency, while the profiler time includes only the latency at the GPU side (PCIe only). Hence profiler time can be considered as latency and CUDA event time as latency + overhead.

| Experiment     | Data sent (MB) | CUDA event time (ms) (L + o) | Profiler time (ms) (L) |    overhead (o) (ms) | Latency / Byte (ps/B) | PCIe throughput (GB/s) |
|----------------+----------------+------------------------------+------------------------+----------------------+-----------------------+------------------------|
| Default config |         13.849 |                      1.10787 |                1.06346 |  0.04440999999999984 |     76.78965990324211 |     13.022586651119928 |
| config 1       |         67.997 |                      5.23046 |                 5.1845 |              0.04596 |        76.24601085342 |     13.115440254605073 |
| config 2       |        107.546 |                      8.34803 |                8.30078 | 0.047250000000000014 |     77.18353076822939 |     12.956131833393972 |
| config 3       |        230.426 |                      17.6256 |               17.57831 | 0.047290000000000276 |     76.28613958494266 |      13.10854115099802 |
| config 4       |        394.266 |                      30.2112 |               30.16069 |  0.05051000000000272 |     76.49832853961539 |     13.072181040950987 |
|----------------+----------------+------------------------------+------------------------+----------------------+-----------------------+------------------------|
| Mean           |                |                              |                        |             0.047084 |             76.600734 |              13.054976 |
#+TBLFM: $5='(- $3 $4);N::$6='(/ (* $4 1000) $2);N::$7='(/ $2 $4);N::@7$5=vmean(@2$5..@6$5)::@7$6=vmean(@2$6..@6$6)::@7$7=vmean(@2$7..@6$7)
